DanilovSoft/ShowerSTM32/stm32-shower/HeaterWatchdog.cpp
#include "HeaterWatchdog.h"
#include "stm32f10x.h"
#include "stm32f10x_rtc.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_pwr.h"
#include "system_stm32f10x.h"
#include "Properties.h"
#include "HeaterTask.h"


void HeaterWatchdog::Init()
{	
    _interval = Properties.HeatingTimeLimitMin * 60;
	
	// Переводим в секунды.
    _absoluteIntervalSec = Properties.AbsoluteHeatingTimeLimitHours * 60 * 60;
		
    _timeoutCounter.Reset();
    _absoluteTimeoutCounter.Reset();
}

void HeaterWatchdog::Reset()
{
    _timeoutCounter.Reset();
    TimeOutOccurred = false;
}
	
void HeaterWatchdog::ResetAbsolute()
{
    _absoluteTimeoutCounter.Reset();
    AbsoluteTimeOutOccured = false;
}
	
bool HeaterWatchdog::TimeOut()
{
	if (TimeOutOccurred)
	{
		return true;
	}
		
    if (_timeoutCounter.Timeout(_interval))
    {
        TimeOutOccurred = true;
        return true;
    }
		
    return false;
}
	
// Абсолютный таймаут отсчитывает время когда включен рубильник автомата.
bool HeaterWatchdog::AbsoluteTimeout()
{
	if (AbsoluteTimeOutOccured)
	{
		return true;
	}
		
    if (_absoluteTimeoutCounter.Timeout(_absoluteIntervalSec))
    {
        AbsoluteTimeOutOccured = true;
        return true;
    }
		
    return false;
}
